Embracecactus/contest2026_135_yongwangzhiqian/board/bk7258_t5ai/chip/cp/bk7258_ota_staging_core.c
/****************************************************************************
 * contest2026_135_yongwangzhiqian/board/bk7258_t5ai/chip/cp/bk7258_ota_staging_core.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Portable N15-B validation/staging core.  It has no NuttX or SDK calls;
 * production and host tests provide separate hash/Flash operation tables.
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <string.h>
#include <errno.h>

#include "bk7258_ota_staging_core.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define BK7258_OTA_DESCRIPTOR_MAGIC       "BKOTA15B"
#define BK7258_OTA_DESCRIPTOR_FORMAT      1u
#define BK7258_OTA_DESCRIPTOR_FLAGS       0u
#define BK7258_OTA_PAIR_SCHEMA            "bk7258-cp-ap-pair-v1"
#define BK7258_OTA_LAYOUT_ID               BK7258_PARTITION_LAYOUT_ID

#define BK7258_OTA_PHYSICAL_START          BK7258_ROLE_SLOT_B_PAIR_OFFSET
#define BK7258_OTA_PHYSICAL_SIZE           BK7258_ROLE_SLOT_B_PAIR_SIZE
#define BK7258_OTA_CP_LOGICAL_OFFSET       0x00000000u
#define BK7258_OTA_CP_CAPACITY             \
  BK7258_ROLE_SLOT_A_CP_LOGICAL_SIZE
#define BK7258_OTA_CP_XIP                  BK7258_ROLE_SLOT_A_CP_XIP_START
#define BK7258_OTA_AP_LOGICAL_OFFSET       BK7258_OTA_CP_CAPACITY
#define BK7258_OTA_AP_CAPACITY             \
  BK7258_ROLE_SLOT_A_AP_LOGICAL_SIZE
#define BK7258_OTA_AP_XIP                  BK7258_ROLE_SLOT_A_AP_XIP_START
#define BK7258_OTA_LOGICAL_SIZE            \
  (BK7258_OTA_CP_CAPACITY + BK7258_OTA_AP_CAPACITY)
#define BK7258_OTA_RBL_HEADER_OFFSET       \
  (BK7258_OTA_LOGICAL_SIZE - BK7258_FLASH_ERASE_SIZE)
#define BK7258_OTA_SRAM_START              0x28000000u
#define BK7258_OTA_SRAM_END                0x280a0000u

#define BK7258_OTA_PACKET_DATA             BK7258_FLASH_CRC_DATA_SIZE
#define BK7258_OTA_PACKET_SIZE             BK7258_FLASH_CRC_TOTAL_SIZE
#define BK7258_OTA_SECTOR_SIZE             BK7258_FLASH_ERASE_SIZE
#define BK7258_OTA_PROGRAM_SIZE            256u
#define BK7258_OTA_BODY_ALIGNMENT          64u
#define BK7258_OTA_RBL_HEADER_SIZE         96u
#define BK7258_OTA_RBL_HEADER_CRC_SIZE     92u
#define BK7258_OTA_FNV_OFFSET              0x811c9dc5u
#define BK7258_OTA_FNV_PRIME               0x01000193u
#define BK7258_OTA_DATA_BUFFER_SIZE        4096u
#define BK7258_OTA_VERIFY_BUFFER_SIZE      256u
#define BK7258_OTA_HASH_BUFFER_OFFSET      4352u
#define BK7258_OTA_HASH_ALIGNMENT          16u

/* Descriptor byte offsets.  The descriptor is serialized explicitly and is
 * never cast to a C struct, so host/target alignment cannot change the ABI.
 */

#define D_MAGIC                0u
#define D_FORMAT               8u
#define D_HEADER_SIZE          10u
#define D_FLAGS                12u
#define D_SCHEMA               16u
#define D_SCHEMA_SIZE          32u
#define D_LAYOUT               48u
#define D_LAYOUT_SIZE          48u
#define D_GENERATION           96u
#define D_TIMESTAMP            104u
#define D_PHYSICAL_OFFSET      108u
#define D_PHYSICAL_SIZE        112u
#define D_LOGICAL_SIZE         116u
#define D_RBL_HEADER_OFFSET    120u
#define D_RBL_PHYSICAL_OFFSET  124u
#define D_CP_OFFSET            128u
#define D_CP_CAPACITY          132u
#define D_CP_LENGTH            136u
#define D_CP_XIP               140u
#define D_AP_OFFSET            144u
#define D_AP_CAPACITY          148u
#define D_AP_LENGTH            152u
#define D_AP_XIP               156u
#define D_VERSION              160u
#define D_BASE_VERSION         184u
#define D_VERSION_SIZE         24u
#define D_PHYSICAL_SHA         208u
#define D_LOGICAL_SHA          240u
#define D_CP_SHA               272u
#define D_AP_SHA               304u
#define D_MANIFEST_SHA         336u
#define D_RESERVED             368u
#define D_RESERVED_SIZE        12u
#define D_HEADER_CRC           380u

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct bk7258_ota_descriptor_s
{
  uint64_t generation;
  uint32_t timestamp;
  uint32_t cp_length;
  uint32_t ap_length;
  uint32_t body_size;
  char version[D_VERSION_SIZE];
  char base_version[D_VERSION_SIZE];
  uint8_t physical_sha[BK7258_OTA_STAGE_SHA256_SIZE];
  uint8_t logical_sha[BK7258_OTA_STAGE_SHA256_SIZE];
  uint8_t cp_sha[BK7258_OTA_STAGE_SHA256_SIZE];
  uint8_t ap_sha[BK7258_OTA_STAGE_SHA256_SIZE];
  uint32_t body_crc32;
  uint32_t body_fnv1a;
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static uint16_t getle16(const uint8_t *value)
{
  return (uint16_t)value[0] | ((uint16_t)value[1] << 8);
}

static uint32_t getle32(const uint8_t *value)
{
  return (uint32_t)value[0] | ((uint32_t)value[1] << 8) |
         ((uint32_t)value[2] << 16) | ((uint32_t)value[3] << 24);
}

static uint64_t getle64(const uint8_t *value)
{
  return (uint64_t)getle32(value) | ((uint64_t)getle32(value + 4) << 32);
}

static uint32_t crc32_update(uint32_t state, const uint8_t *data, size_t len)
{
  size_t index;
  unsigned int bit;

  for (index = 0; index < len; index++)
    {
      state ^= data[index];
      for (bit = 0; bit < 8; bit++)
        {
          state = (state >> 1) ^
                  ((state & 1u) ? 0xedb88320u : 0u);
        }
    }

  return state;
}

static uint32_t crc32_bytes(const uint8_t *data, size_t len)
{
  return crc32_update(0xffffffffu, data, len) ^ 0xffffffffu;
}

static uint16_t crc16_packet(const uint8_t *data)
{
  uint16_t crc = 0xffffu;
  size_t index;
  unsigned int bit;

  for (index = 0; index < BK7258_OTA_PACKET_DATA; index++)
    {
      crc ^= (uint16_t)data[index] << 8;
      for (bit = 0; bit < 8; bit++)
        {
          crc = (uint16_t)((crc << 1) ^
                           ((crc & 0x8000u) ? 0x8005u : 0u));
        }
    }

