Embracecactus/contest2026_135_yongwangzhiqian/board/bk7258_t5ai/chip/cp/bk7258_ota_staging_core.c
  return crc;
}

static uint32_t align_up(uint32_t value, uint32_t alignment)
{
  return (value + alignment - 1u) & ~(alignment - 1u);
}

static uint32_t rbl_physical_offset(uint32_t logical)
{
  return (logical / BK7258_OTA_PACKET_DATA) * BK7258_OTA_PACKET_SIZE;
}

static bool version_character(uint8_t value, bool first)
{
  if ((value >= 'A' && value <= 'Z') ||
      (value >= 'a' && value <= 'z') ||
      (value >= '0' && value <= '9'))
    {
      return true;
    }

  return !first &&
         (value == '.' || value == '_' || value == '+' || value == '-');
}

static int parse_string(const uint8_t *raw, size_t raw_size, char *output,
                        size_t output_size, bool version)
{
  size_t length;
  size_t index;

  for (length = 0; length < raw_size && raw[length] != 0; length++)
    {
      if (raw[length] > 0x7fu ||
          (version && !version_character(raw[length], length == 0)))
        {
          return -EINVAL;
        }
    }

  if (length == 0 || length == raw_size || length >= output_size)
    {
      return -EINVAL;
    }

  for (index = length; index < raw_size; index++)
    {
      if (raw[index] != 0)
        {
          return -EINVAL;
        }
    }

  memcpy(output, raw, length);
  output[length] = '\0';
  return 0;
}

static int validate_expected_string(const char *value)
{
  size_t length;

  for (length = 0; length < D_VERSION_SIZE && value[length] != '\0';
       length++)
    {
      if (!version_character((uint8_t)value[length], length == 0))
        {
          return -EINVAL;
        }
    }

  return length > 0 && length < D_VERSION_SIZE ? 0 : -EINVAL;
}

static bool digest_nonzero(const uint8_t *digest)
{
  size_t index;

  for (index = 0; index < BK7258_OTA_STAGE_SHA256_SIZE; index++)
    {
      if (digest[index] != 0)
        {
          return true;
        }
    }

  return false;
}

static int source_read(const struct bk7258_ota_source_s *source,
                       uint32_t offset, uint8_t *buffer, size_t len)
{
  int ret;

  if (offset > source->size || len > source->size - offset)
    {
      return -EINVAL;
    }

  ret = source->read(source->arg, offset, buffer, len);
  if (ret > 0)
    {
      return -EIO;
    }

  return ret;
}

static void copy_overlap(uint8_t *destination, uint32_t range_start,
                         uint32_t range_size, uint32_t block_start,
                         const uint8_t *block, uint32_t block_size)
{
  uint32_t start = block_start > range_start ? block_start : range_start;
  uint32_t block_end = block_start + block_size;
  uint32_t range_end = range_start + range_size;
  uint32_t end = block_end < range_end ? block_end : range_end;

  if (start < end)
    {
      memcpy(destination + start - range_start, block + start - block_start,
             end - start);
    }
}

static void hash_overlap(const struct bk7258_ota_hash_ops_s *ops,
                         void *context, uint32_t range_start,
                         uint32_t range_size, uint32_t block_start,
                         const uint8_t *block, uint32_t block_size)
{
  uint32_t start = block_start > range_start ? block_start : range_start;
  uint32_t block_end = block_start + block_size;
  uint32_t range_end = range_start + range_size;
  uint32_t end = block_end < range_end ? block_end : range_end;

  if (start < end)
    {
      ops->update(context, block + start - block_start, end - start);
    }
}

static int parse_descriptor(
  const uint8_t descriptor[BK7258_OTA_STAGE_DESCRIPTOR_SIZE],
  const struct bk7258_ota_expected_s *expected,
  uint32_t expected_physical_start,
  struct bk7258_ota_descriptor_s *parsed)
{
  char schema[D_SCHEMA_SIZE];
  char layout[D_LAYOUT_SIZE];
  uint32_t expected_crc;
  uint32_t observed_crc;
  uint32_t body_size;
  size_t index;

  if (descriptor == NULL || expected == NULL || parsed == NULL ||
      (expected_physical_start != BK7258_ROLE_SLOT_A_CP_OFFSET &&
       expected_physical_start != BK7258_ROLE_SLOT_B_PAIR_OFFSET) ||
      expected->generation == 0 ||
      validate_expected_string(expected->version) < 0 ||
      validate_expected_string(expected->base_version) < 0)
    {
      return -EINVAL;
    }

  expected_crc = getle32(descriptor + D_HEADER_CRC);
  observed_crc = crc32_bytes(descriptor, D_HEADER_CRC);
  if (expected_crc != observed_crc)
    {
      return -EBADMSG;
    }

  if (memcmp(descriptor + D_MAGIC, BK7258_OTA_DESCRIPTOR_MAGIC, 8) != 0 ||
      getle16(descriptor + D_FORMAT) != BK7258_OTA_DESCRIPTOR_FORMAT ||
      getle16(descriptor + D_HEADER_SIZE) !=
        BK7258_OTA_STAGE_DESCRIPTOR_SIZE ||
      getle32(descriptor + D_FLAGS) != BK7258_OTA_DESCRIPTOR_FLAGS ||
      parse_string(descriptor + D_SCHEMA, D_SCHEMA_SIZE, schema,
                   sizeof(schema), false) < 0 ||
      strcmp(schema, BK7258_OTA_PAIR_SCHEMA) != 0 ||
      parse_string(descriptor + D_LAYOUT, D_LAYOUT_SIZE, layout,
                   sizeof(layout), false) < 0 ||
      strcmp(layout, BK7258_OTA_LAYOUT_ID) != 0)
    {
      return -EINVAL;
    }

  for (index = 0; index < D_RESERVED_SIZE; index++)
    {
      if (descriptor[D_RESERVED + index] != 0)
        {
          return -EINVAL;
        }
    }

  parsed->generation = getle64(descriptor + D_GENERATION);
  parsed->timestamp = getle32(descriptor + D_TIMESTAMP);
  parsed->cp_length = getle32(descriptor + D_CP_LENGTH);
  parsed->ap_length = getle32(descriptor + D_AP_LENGTH);

  if (parsed->generation == 0 ||
      parsed->generation != expected->generation ||
      parsed->timestamp != expected->timestamp ||
      getle32(descriptor + D_PHYSICAL_OFFSET) != expected_physical_start ||
      getle32(descriptor + D_PHYSICAL_SIZE) != BK7258_OTA_PHYSICAL_SIZE ||
      getle32(descriptor + D_LOGICAL_SIZE) != BK7258_OTA_LOGICAL_SIZE ||
      getle32(descriptor + D_RBL_HEADER_OFFSET) !=
        BK7258_OTA_RBL_HEADER_OFFSET ||
      getle32(descriptor + D_RBL_PHYSICAL_OFFSET) !=
        rbl_physical_offset(BK7258_OTA_RBL_HEADER_OFFSET) ||
      getle32(descriptor + D_CP_OFFSET) != BK7258_OTA_CP_LOGICAL_OFFSET ||
      getle32(descriptor + D_CP_CAPACITY) != BK7258_OTA_CP_CAPACITY ||
      getle32(descriptor + D_CP_XIP) != BK7258_OTA_CP_XIP ||
      getle32(descriptor + D_AP_OFFSET) != BK7258_OTA_AP_LOGICAL_OFFSET ||
      getle32(descriptor + D_AP_CAPACITY) != BK7258_OTA_AP_CAPACITY ||
      getle32(descriptor + D_AP_XIP) != BK7258_OTA_AP_XIP ||
      parsed->cp_length < 0x108u ||
      parsed->cp_length > BK7258_OTA_CP_CAPACITY ||
      parsed->ap_length < 8u ||
      parsed->ap_length > BK7258_OTA_AP_CAPACITY)
    {
      return -EINVAL;
    }

  body_size = align_up(BK7258_OTA_AP_LOGICAL_OFFSET + parsed->ap_length,
                       BK7258_OTA_BODY_ALIGNMENT);
  if (body_size >= BK7258_OTA_RBL_HEADER_OFFSET)
    {
      return -EINVAL;
    }

  parsed->body_size = body_size;
  if (parse_string(descriptor + D_VERSION, D_VERSION_SIZE, parsed->version,
                   sizeof(parsed->version), true) < 0 ||
      parse_string(descriptor + D_BASE_VERSION, D_VERSION_SIZE,
                   parsed->base_version, sizeof(parsed->base_version),
                   true) < 0 ||
      strcmp(parsed->version, expected->version) != 0 ||
      strcmp(parsed->base_version, expected->base_version) != 0 ||
      strcmp(parsed->version, parsed->base_version) == 0)
    {
      return -EINVAL;
    }

