Embracecactus/contest2026_135_yongwangzhiqian/board/bk7258_t5ai/chip/cp/bk7258_ota_staging_core.c
  memcpy(parsed->physical_sha, descriptor + D_PHYSICAL_SHA,
         BK7258_OTA_STAGE_SHA256_SIZE);
  memcpy(parsed->logical_sha, descriptor + D_LOGICAL_SHA,
         BK7258_OTA_STAGE_SHA256_SIZE);
  memcpy(parsed->cp_sha, descriptor + D_CP_SHA,
         BK7258_OTA_STAGE_SHA256_SIZE);
  memcpy(parsed->ap_sha, descriptor + D_AP_SHA,
         BK7258_OTA_STAGE_SHA256_SIZE);

  if (!digest_nonzero(parsed->physical_sha) ||
      !digest_nonzero(parsed->logical_sha) ||
      !digest_nonzero(parsed->cp_sha) ||
      !digest_nonzero(parsed->ap_sha) ||
      !digest_nonzero(descriptor + D_MANIFEST_SHA))
    {
      return -EINVAL;
    }

  return 0;
}

static int validate_rbl_header(
  const struct bk7258_ota_source_s *source,
  const struct bk7258_ota_descriptor_s *parsed, uint8_t *buffer,
  uint32_t *body_crc32, uint32_t *body_fnv1a)
{
  uint8_t header[BK7258_OTA_RBL_HEADER_SIZE];
  char app_partition[16];
  char download_version[D_VERSION_SIZE];
  char current_version[D_VERSION_SIZE];
  uint32_t physical_offset;
  uint32_t index;
  uint16_t stored_crc;
  int ret;

  physical_offset = rbl_physical_offset(BK7258_OTA_RBL_HEADER_OFFSET);
  ret = source_read(source, physical_offset, buffer,
                    3u * BK7258_OTA_PACKET_SIZE);
  if (ret < 0)
    {
      return ret;
    }

  for (index = 0; index < 3; index++)
    {
      uint8_t *packet = buffer + index * BK7258_OTA_PACKET_SIZE;

      stored_crc = ((uint16_t)packet[32] << 8) | packet[33];
      if (crc16_packet(packet) != stored_crc)
        {
          return -EBADMSG;
        }

      memcpy(header + index * BK7258_OTA_PACKET_DATA, packet,
             BK7258_OTA_PACKET_DATA);
    }

  if (memcmp(header, "RBL\0", 4) != 0 || getle16(header + 4) != 0 ||
      header[6] != 0 || header[7] != 0 ||
      getle32(header + 8) != parsed->timestamp ||
      parse_string(header + 12, 16, app_partition, sizeof(app_partition),
                   false) < 0 ||
      strcmp(app_partition, "app") != 0 ||
      parse_string(header + 28, D_VERSION_SIZE, download_version,
                   sizeof(download_version), true) < 0 ||
      strcmp(download_version, parsed->version) != 0 ||
      parse_string(header + 52, D_VERSION_SIZE, current_version,
                   sizeof(current_version), true) < 0 ||
      strcmp(current_version, "00010203040506070809") != 0 ||
      getle32(header + 84) != parsed->body_size ||
      getle32(header + 88) != parsed->body_size ||
      crc32_bytes(header, BK7258_OTA_RBL_HEADER_CRC_SIZE) !=
        getle32(header + 92))
    {
      return -EBADMSG;
    }

  *body_crc32 = getle32(header + 76);
  *body_fnv1a = getle32(header + 80);
  return 0;
}

static int validate_vectors(const struct bk7258_ota_descriptor_s *parsed,
                            const uint8_t cp_vector[8],
                            const uint8_t ap_vector[8],
                            const uint8_t cp_magic[8])
{
  uint32_t cp_msp = getle32(cp_vector);
  uint32_t cp_reset = getle32(cp_vector + 4);
  uint32_t ap_msp = getle32(ap_vector);
  uint32_t ap_reset = getle32(ap_vector + 4);

  if (cp_msp < BK7258_OTA_SRAM_START || cp_msp >= BK7258_OTA_SRAM_END ||
      ap_msp < BK7258_OTA_SRAM_START || ap_msp >= BK7258_OTA_SRAM_END ||
      (cp_reset & 1u) == 0 || (ap_reset & 1u) == 0 ||
      (cp_reset & ~1u) < BK7258_OTA_CP_XIP ||
      (cp_reset & ~1u) >= BK7258_OTA_CP_XIP + parsed->cp_length ||
      (ap_reset & ~1u) < BK7258_OTA_AP_XIP ||
      (ap_reset & ~1u) >= BK7258_OTA_AP_XIP + parsed->ap_length ||
      memcmp(cp_magic, "BK7236\0\0", 8) != 0)
    {
      return -EBADMSG;
    }

  return 0;
}

static int validate_source(
  const uint8_t descriptor[BK7258_OTA_STAGE_DESCRIPTOR_SIZE],
  const struct bk7258_ota_expected_s *expected,
  uint32_t expected_physical_start,
  const struct bk7258_ota_source_s *source,
  const struct bk7258_ota_hash_ops_s *hash_ops,
  uint8_t *scratch, size_t scratch_size,
  struct bk7258_ota_descriptor_s *parsed)
{
  uint8_t *data = scratch;
  uint8_t *hash_area = scratch + BK7258_OTA_HASH_BUFFER_OFFSET;
  uint8_t *physical_context;
  uint8_t *logical_context;
  uint8_t *cp_context;
  uint8_t *ap_context;
  uint8_t physical_sha[BK7258_OTA_STAGE_SHA256_SIZE];
  uint8_t logical_sha[BK7258_OTA_STAGE_SHA256_SIZE];
  uint8_t cp_sha[BK7258_OTA_STAGE_SHA256_SIZE];
  uint8_t ap_sha[BK7258_OTA_STAGE_SHA256_SIZE];
  uint8_t cp_vector[8] = {0};
  uint8_t ap_vector[8] = {0};
  uint8_t cp_magic[8] = {0};
  size_t context_stride;
  uint32_t expected_body_crc;
  uint32_t expected_body_fnv;
  uint32_t body_crc = 0xffffffffu;
  uint32_t body_fnv = BK7258_OTA_FNV_OFFSET;
  uint32_t physical_offset;
  uint32_t logical_offset;
  uint32_t chunk_size;
  uint32_t packet_offset;
  uint32_t index;
  int ret;

  if (source == NULL || source->read == NULL || hash_ops == NULL ||
      hash_ops->init == NULL || hash_ops->update == NULL ||
      hash_ops->final == NULL || hash_ops->context_size == 0 ||
      hash_ops->context_size > BK7258_OTA_HASH_CONTEXT_MAX ||
      scratch == NULL || scratch_size < BK7258_OTA_STAGE_SCRATCH_SIZE)
    {
      return -EINVAL;
    }

  ret = parse_descriptor(descriptor, expected, expected_physical_start,
                         parsed);
  if (ret < 0)
    {
      return ret;
    }

  if (source->size != BK7258_OTA_PHYSICAL_SIZE)
    {
      return -EINVAL;
    }

  ret = validate_rbl_header(source, parsed, data, &expected_body_crc,
                            &expected_body_fnv);
  if (ret < 0)
    {
      return ret;
    }

  parsed->body_crc32 = expected_body_crc;
  parsed->body_fnv1a = expected_body_fnv;
  context_stride = (hash_ops->context_size + BK7258_OTA_HASH_ALIGNMENT - 1u) &
                   ~(BK7258_OTA_HASH_ALIGNMENT - 1u);
  if (BK7258_OTA_HASH_BUFFER_OFFSET + 4u * context_stride > scratch_size)
    {
      return -EINVAL;
    }

  physical_context = hash_area;
  logical_context = physical_context + context_stride;
  cp_context = logical_context + context_stride;
  ap_context = cp_context + context_stride;
  hash_ops->init(physical_context);
  hash_ops->init(logical_context);
  hash_ops->init(cp_context);
  hash_ops->init(ap_context);

