Embracecactus/contest2026_135_yongwangzhiqian/board/bk7258_t5ai/chip/cp/bk7258_ota_staging_core.c
  for (physical_offset = 0; physical_offset < source->size;
       physical_offset += chunk_size)
    {
      chunk_size = source->size - physical_offset;
      if (chunk_size > BK7258_OTA_DATA_BUFFER_SIZE)
        {
          chunk_size = (BK7258_OTA_DATA_BUFFER_SIZE /
                        BK7258_OTA_PACKET_SIZE) * BK7258_OTA_PACKET_SIZE;
        }

      ret = source_read(source, physical_offset, data, chunk_size);
      if (ret < 0)
        {
          return ret;
        }

      hash_ops->update(physical_context, data, chunk_size);
      for (packet_offset = 0; packet_offset < chunk_size;
           packet_offset += BK7258_OTA_PACKET_SIZE)
        {
          const uint8_t *packet = data + packet_offset;
          uint16_t stored_crc = ((uint16_t)packet[32] << 8) | packet[33];
          uint32_t body_bytes;

          if (crc16_packet(packet) != stored_crc)
            {
              return -EBADMSG;
            }

          logical_offset = ((physical_offset + packet_offset) /
                            BK7258_OTA_PACKET_SIZE) *
                           BK7258_OTA_PACKET_DATA;
          hash_ops->update(logical_context, packet,
                           BK7258_OTA_PACKET_DATA);
          hash_overlap(hash_ops, cp_context, BK7258_OTA_CP_LOGICAL_OFFSET,
                       parsed->cp_length, logical_offset, packet,
                       BK7258_OTA_PACKET_DATA);
          hash_overlap(hash_ops, ap_context, BK7258_OTA_AP_LOGICAL_OFFSET,
                       parsed->ap_length, logical_offset, packet,
                       BK7258_OTA_PACKET_DATA);

          copy_overlap(cp_vector, BK7258_OTA_CP_LOGICAL_OFFSET, 8,
                       logical_offset, packet, BK7258_OTA_PACKET_DATA);
          copy_overlap(ap_vector, BK7258_OTA_AP_LOGICAL_OFFSET, 8,
                       logical_offset, packet, BK7258_OTA_PACKET_DATA);
          copy_overlap(cp_magic, BK7258_OTA_CP_LOGICAL_OFFSET + 0x100u, 8,
                       logical_offset, packet, BK7258_OTA_PACKET_DATA);

          body_bytes = 0;
          if (logical_offset < parsed->body_size)
            {
              body_bytes = parsed->body_size - logical_offset;
              if (body_bytes > BK7258_OTA_PACKET_DATA)
                {
                  body_bytes = BK7258_OTA_PACKET_DATA;
                }

              body_crc = crc32_update(body_crc, packet, body_bytes);
              for (index = 0; index < body_bytes; index++)
                {
                  body_fnv = (body_fnv ^ packet[index]) *
                             BK7258_OTA_FNV_PRIME;
                }
            }

          for (index = 0; index < BK7258_OTA_PACKET_DATA; index++)
            {
              uint32_t position = logical_offset + index;
              bool payload = position < parsed->cp_length ||
                (position >= BK7258_OTA_AP_LOGICAL_OFFSET &&
                 position < BK7258_OTA_AP_LOGICAL_OFFSET +
                            parsed->ap_length) ||
                (position >= BK7258_OTA_RBL_HEADER_OFFSET &&
                 position < BK7258_OTA_RBL_HEADER_OFFSET +
                            BK7258_OTA_RBL_HEADER_SIZE);

              if (!payload && packet[index] != 0xffu)
                {
                  return -EBADMSG;
                }
            }
        }
    }

  hash_ops->final(physical_context, physical_sha);
  hash_ops->final(logical_context, logical_sha);
  hash_ops->final(cp_context, cp_sha);
  hash_ops->final(ap_context, ap_sha);
  body_crc ^= 0xffffffffu;

  if (memcmp(physical_sha, parsed->physical_sha,
             BK7258_OTA_STAGE_SHA256_SIZE) != 0 ||
      memcmp(logical_sha, parsed->logical_sha,
             BK7258_OTA_STAGE_SHA256_SIZE) != 0 ||
      memcmp(cp_sha, parsed->cp_sha, BK7258_OTA_STAGE_SHA256_SIZE) != 0 ||
      memcmp(ap_sha, parsed->ap_sha, BK7258_OTA_STAGE_SHA256_SIZE) != 0 ||
      body_crc != parsed->body_crc32 || body_fnv != parsed->body_fnv1a)
    {
      return -EBADMSG;
    }

  return validate_vectors(parsed, cp_vector, ap_vector, cp_magic);
}

static bool deadline_expired(const struct bk7258_ota_flash_ops_s *ops,
                             uint64_t start_ms, uint32_t timeout_ms)
{
  return ops->now_ms(ops->arg) - start_ms >= timeout_ms;
}

static uint32_t deadline_remaining(
  const struct bk7258_ota_flash_ops_s *ops, uint64_t start_ms,
  uint32_t timeout_ms)
{
  uint64_t elapsed = ops->now_ms(ops->arg) - start_ms;

  if (elapsed >= timeout_ms)
    {
      return 0;
    }

  return timeout_ms - (uint32_t)elapsed;
}

static int flash_result(int ret)
{
  return ret < 0 ? ret : (ret == 0 ? 0 : -EIO);
}

static void set_failure(struct bk7258_ota_stage_result_s *result, int status,
                        enum bk7258_ota_stage_phase_e phase)
{
  result->status = status;
  result->phase = phase;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

int bk7258_ota_core_validate(
  const uint8_t descriptor[BK7258_OTA_STAGE_DESCRIPTOR_SIZE],
  const struct bk7258_ota_expected_s *expected,
  const struct bk7258_ota_source_s *source,
  const struct bk7258_ota_hash_ops_s *hash_ops,
  uint8_t *scratch, size_t scratch_size,
  struct bk7258_ota_stage_result_s *result)
{
  struct bk7258_ota_descriptor_s parsed;
  int ret;

  if (result == NULL)
    {
      return -EINVAL;
    }

  memset(result, 0, sizeof(*result));
  result->phase = BK7258_OTA_STAGE_PREFLIGHT;
  ret = validate_source(descriptor, expected, BK7258_OTA_PHYSICAL_START,
                        source, hash_ops, scratch, scratch_size, &parsed);
  if (ret < 0)
    {
      set_failure(result, ret, BK7258_OTA_STAGE_PREFLIGHT);
      return ret;
    }

  result->generation = parsed.generation;
  result->status = 0;
  result->phase = BK7258_OTA_STAGE_DONE;
  return 0;
}

int bk7258_ota_core_validate_at(
  uint32_t physical_start,
  const uint8_t descriptor[BK7258_OTA_STAGE_DESCRIPTOR_SIZE],
  const struct bk7258_ota_expected_s *expected,
  const struct bk7258_ota_source_s *source,
  const struct bk7258_ota_hash_ops_s *hash_ops,
  uint8_t *scratch, size_t scratch_size,
  struct bk7258_ota_stage_result_s *result)
{
  struct bk7258_ota_descriptor_s parsed;
  int ret;

  if (result == NULL)
    {
      return -EINVAL;
    }

  memset(result, 0, sizeof(*result));
  result->phase = BK7258_OTA_STAGE_PREFLIGHT;
  ret = validate_source(descriptor, expected, physical_start, source,
                        hash_ops, scratch, scratch_size, &parsed);
  if (ret < 0)
    {
      set_failure(result, ret, BK7258_OTA_STAGE_PREFLIGHT);
      return ret;
    }

  result->generation = parsed.generation;
  result->status = 0;
  result->phase = BK7258_OTA_STAGE_DONE;
  return 0;
}

static int bk7258_ota_core_stage_at_internal(
  uint32_t physical_start, uint32_t active_physical_start,
  const uint8_t descriptor[BK7258_OTA_STAGE_DESCRIPTOR_SIZE],
  const struct bk7258_ota_expected_s *expected,
  const struct bk7258_ota_source_s *source,
  const struct bk7258_ota_hash_ops_s *hash_ops,
  const struct bk7258_ota_flash_ops_s *flash_ops,
  uint32_t timeout_ms, uint8_t *scratch, size_t scratch_size,
  struct bk7258_ota_stage_result_s *result)
{
  struct bk7258_ota_descriptor_s parsed;
  uint8_t *data = scratch;
  uint8_t *verify = scratch + BK7258_OTA_DATA_BUFFER_SIZE;
  uint8_t *hash_context = scratch + BK7258_OTA_HASH_BUFFER_OFFSET;
  uint8_t observed_sha[BK7258_OTA_STAGE_SHA256_SIZE];
  uint64_t start_ms;
  uint32_t sector_offset;
  uint32_t chunk_offset;
  uint32_t remaining;
  int ret;
  bool locked;

