Embracecactus/contest2026_135_yongwangzhiqian/board/bk7258_t5ai/chip/cp/bk7258_ota_staging_core.c
  if (result == NULL ||
      (physical_start != BK7258_ROLE_SLOT_A_CP_OFFSET &&
       physical_start != BK7258_ROLE_SLOT_B_PAIR_OFFSET) ||
      (active_physical_start != BK7258_ROLE_SLOT_A_CP_OFFSET &&
       active_physical_start != BK7258_ROLE_SLOT_B_PAIR_OFFSET) ||
      physical_start == active_physical_start ||
      flash_ops == NULL || flash_ops->now_ms == NULL ||
      flash_ops->compile_write_enabled == NULL ||
      flash_ops->runtime_write_enabled == NULL || flash_ops->lock == NULL ||
      flash_ops->unlock == NULL || flash_ops->erase_sector == NULL ||
      flash_ops->write == NULL || flash_ops->read == NULL ||
      timeout_ms == 0)
    {
      return -EINVAL;
    }

  memset(result, 0, sizeof(*result));
  result->phase = BK7258_OTA_STAGE_PREFLIGHT;
  ret = validate_source(descriptor, expected, physical_start,
                        source, hash_ops, scratch, scratch_size, &parsed);
  if (ret < 0)
    {
      set_failure(result, ret, BK7258_OTA_STAGE_PREFLIGHT);
      return ret;
    }

  result->generation = parsed.generation;
  if (!flash_ops->compile_write_enabled(flash_ops->arg) ||
      !flash_ops->runtime_write_enabled(flash_ops->arg))
    {
      set_failure(result, -EACCES, BK7258_OTA_STAGE_PREFLIGHT);
      return -EACCES;
    }

  if (hash_ops->context_size > BK7258_OTA_HASH_CONTEXT_MAX ||
      scratch_size < BK7258_OTA_STAGE_SCRATCH_SIZE)
    {
      set_failure(result, -EINVAL, BK7258_OTA_STAGE_PREFLIGHT);
      return -EINVAL;
    }

  start_ms = flash_ops->now_ms(flash_ops->arg);
  for (sector_offset = 0; sector_offset < BK7258_OTA_PHYSICAL_SIZE;
       sector_offset += BK7258_OTA_SECTOR_SIZE)
    {
      if (deadline_expired(flash_ops, start_ms, timeout_ms))
        {
          set_failure(result, -ETIMEDOUT, result->phase);
          return -ETIMEDOUT;
        }

      ret = source_read(source, sector_offset, data,
                        BK7258_OTA_SECTOR_SIZE);
      if (ret < 0)
        {
          set_failure(result, ret, BK7258_OTA_STAGE_PREFLIGHT);
          return ret;
        }

      remaining = deadline_remaining(flash_ops, start_ms, timeout_ms);
      if (remaining == 0)
        {
          set_failure(result, -ETIMEDOUT, result->phase);
          return -ETIMEDOUT;
        }

      ret = flash_ops->lock(flash_ops->arg, remaining);
      if (ret != 0)
        {
          ret = flash_result(ret);
          set_failure(result, ret, result->phase);
          return ret;
        }

      locked = true;
      if (!flash_ops->runtime_write_enabled(flash_ops->arg))
        {
          ret = -EACCES;
          goto sector_failure;
        }

      result->phase = BK7258_OTA_STAGE_ERASE;
      if (!flash_ops->runtime_write_enabled(flash_ops->arg))
        {
          ret = -EACCES;
          goto sector_failure;
        }

      ret = flash_result(flash_ops->erase_sector(
        flash_ops->arg, physical_start + sector_offset));
      if (ret < 0)
        {
          goto sector_failure;
        }

      result->sectors_erased++;
      for (chunk_offset = 0; chunk_offset < BK7258_OTA_SECTOR_SIZE;
           chunk_offset += BK7258_OTA_VERIFY_BUFFER_SIZE)
        {
          if (deadline_expired(flash_ops, start_ms, timeout_ms))
            {
              ret = -ETIMEDOUT;
              goto sector_failure;
            }

          ret = flash_result(flash_ops->read(
            flash_ops->arg,
            physical_start + sector_offset + chunk_offset,
            verify, BK7258_OTA_VERIFY_BUFFER_SIZE));
          if (ret < 0)
            {
              goto sector_failure;
            }

          for (remaining = 0; remaining < BK7258_OTA_VERIFY_BUFFER_SIZE;
               remaining++)
            {
              if (verify[remaining] != 0xffu)
                {
                  ret = -EIO;
                  goto sector_failure;
                }
            }
        }

      result->phase = BK7258_OTA_STAGE_PROGRAM;
      for (chunk_offset = 0; chunk_offset < BK7258_OTA_SECTOR_SIZE;
           chunk_offset += BK7258_OTA_PROGRAM_SIZE)
        {
          if (deadline_expired(flash_ops, start_ms, timeout_ms))
            {
              ret = -ETIMEDOUT;
              goto sector_failure;
            }

          if (!flash_ops->runtime_write_enabled(flash_ops->arg))
            {
              ret = -EACCES;
              goto sector_failure;
            }

          ret = flash_result(flash_ops->write(
            flash_ops->arg,
            physical_start + sector_offset + chunk_offset,
            data + chunk_offset, BK7258_OTA_PROGRAM_SIZE));
          if (ret < 0)
            {
              goto sector_failure;
            }

          result->bytes_programmed += BK7258_OTA_PROGRAM_SIZE;
          result->phase = BK7258_OTA_STAGE_READBACK;
          ret = flash_result(flash_ops->read(
            flash_ops->arg,
            physical_start + sector_offset + chunk_offset,
            verify, BK7258_OTA_PROGRAM_SIZE));
          if (ret < 0 ||
              memcmp(verify, data + chunk_offset,
                     BK7258_OTA_PROGRAM_SIZE) != 0)
            {
              ret = ret < 0 ? ret : -EIO;
              goto sector_failure;
            }

          result->bytes_readback += BK7258_OTA_PROGRAM_SIZE;
          result->phase = BK7258_OTA_STAGE_PROGRAM;
        }

      flash_ops->unlock(flash_ops->arg);
      locked = false;
      continue;

sector_failure:
      if (locked)
        {
          flash_ops->unlock(flash_ops->arg);
        }

      set_failure(result, ret, result->phase);
      return ret;
    }

  result->phase = BK7258_OTA_STAGE_FINAL_DIGEST;
  hash_ops->init(hash_context);
  for (sector_offset = 0; sector_offset < BK7258_OTA_PHYSICAL_SIZE;
       sector_offset += BK7258_OTA_SECTOR_SIZE)
    {
      remaining = deadline_remaining(flash_ops, start_ms, timeout_ms);
      if (remaining == 0)
        {
          set_failure(result, -ETIMEDOUT,
                      BK7258_OTA_STAGE_FINAL_DIGEST);
          return -ETIMEDOUT;
        }

