Embracecactus/contest2026_135_yongwangzhiqian/board/bk7258_t5ai/chip/cp/bk7258_ota_staging_core.c
      ret = flash_ops->lock(flash_ops->arg, remaining);
      if (ret != 0)
        {
          ret = flash_result(ret);
          set_failure(result, ret, BK7258_OTA_STAGE_FINAL_DIGEST);
          return ret;
        }

      ret = flash_result(flash_ops->read(
        flash_ops->arg, physical_start + sector_offset,
        data, BK7258_OTA_SECTOR_SIZE));
      flash_ops->unlock(flash_ops->arg);
      if (ret < 0)
        {
          set_failure(result, ret, BK7258_OTA_STAGE_FINAL_DIGEST);
          return ret;
        }

      hash_ops->update(hash_context, data, BK7258_OTA_SECTOR_SIZE);
    }

  hash_ops->final(hash_context, observed_sha);
  memcpy(result->slot_sha256, observed_sha, sizeof(result->slot_sha256));
  if (memcmp(observed_sha, parsed.physical_sha,
             BK7258_OTA_STAGE_SHA256_SIZE) != 0)
    {
      set_failure(result, -EBADMSG, BK7258_OTA_STAGE_FINAL_DIGEST);
      return -EBADMSG;
    }

  result->status = 0;
  result->phase = BK7258_OTA_STAGE_DONE;
  return 0;
}

int bk7258_ota_core_stage(
  const uint8_t descriptor[BK7258_OTA_STAGE_DESCRIPTOR_SIZE],
  const struct bk7258_ota_expected_s *expected,
  const struct bk7258_ota_source_s *source,
  const struct bk7258_ota_hash_ops_s *hash_ops,
  const struct bk7258_ota_flash_ops_s *flash_ops,
  uint32_t timeout_ms, uint8_t *scratch, size_t scratch_size,
  struct bk7258_ota_stage_result_s *result)
{
  return bk7258_ota_core_stage_at_internal(
    BK7258_ROLE_SLOT_B_PAIR_OFFSET, BK7258_ROLE_SLOT_A_CP_OFFSET,
    descriptor, expected, source, hash_ops, flash_ops, timeout_ms, scratch,
    scratch_size, result);
}

int bk7258_ota_core_stage_inactive(
  uint32_t physical_start, uint32_t active_physical_start,
  const uint8_t descriptor[BK7258_OTA_STAGE_DESCRIPTOR_SIZE],
  const struct bk7258_ota_expected_s *expected,
  const struct bk7258_ota_source_s *source,
  const struct bk7258_ota_hash_ops_s *hash_ops,
  const struct bk7258_ota_flash_ops_s *flash_ops,
  uint32_t timeout_ms, uint8_t *scratch, size_t scratch_size,
  struct bk7258_ota_stage_result_s *result)
{
  return bk7258_ota_core_stage_at_internal(
    physical_start, active_physical_start, descriptor, expected, source,
    hash_ops, flash_ops, timeout_ms, scratch, scratch_size, result);
}
